import pandas as pd
import time


def re_place(x):
    # s1 = ['阴道泡腾胶囊', '鼻用喷雾剂', '鼻用吸入剂', '混悬注射剂', '混悬注射液',
    #       '阴道软胶囊', '缓释植入剂', '阴道泡腾片', '吸入混悬液', '雾化溶液',
    #       '鼻用制剂', '耳用制剂', '阴道胶囊', '吸入溶液', '滴鼻液', '滴耳剂',
    #       '滴耳液', '滴眼液', '粉雾剂', '灌肠剂', '含漱液', '吸入剂', '眼用凝胶',
    #       '混悬液', '阴道片', '阴道栓', '喷雾剂', '溶液', '栓剂', '水剂',
    #       '宫内节育器']
    # s2 = ['巴布膏', '茶剂', '搽剂', '酊剂', '锭剂', '膏剂', '煎膏剂', '口胶',
    #       '外用凝胶', '气雾剂', '乳膏', '乳剂', '乳胶', '软膏', '霜剂', '贴剂',
    #       '透皮贴剂', '涂剂', '外用片', '凝胶', '洗剂', '橡胶膏', '眼膏',
    #       '眼用制剂', '硬膏', '控释透皮贴', '流浸膏', '敷料', '贴剂(软膏型)',
    #       '阴道药膜', '冲洗液', '涂膜',  '湿巾', '喷剂',  '洗液', '醑', '控释贴',
    #       '混悬气雾剂',  '湿敷剂', '缓释透皮贴', '油剂',  '缓释凝胶', '洗发剂'
    #       ]
    s3 = ['包衣片', '肠溶缓释胶囊', '肠溶缓释片', '肠溶胶囊', '肠溶胶丸',
          '肠溶颗粒', '肠溶片', '肠溶微丸', '肠溶微丸胶囊', '丹剂', '滴剂',
          '滴丸', '分散片', '干混悬剂', '干糖浆', '含片', '合剂', '缓释胶囊',
          '缓释片', '缓释微粒', '缓释小丸', '混悬滴剂', '混悬剂', '混悬颗粒',
          '胶剂', '胶浆剂', '酒剂', '咀嚼片', '颗粒', '颗粒剂', '控释胶囊',
          '控释片', '口服冻干粉', '口服缓释混悬液', '口服溶液', '口服液',
          '口腔崩解片', '露剂', '膜剂', '浓缩丸', '泡腾片', '片剂', '溶液剂',
          '软胶囊', '散剂', '双释放肠溶胶囊', '水煎剂', '速释片', '汤剂',
          '糖浆', '丸剂', '微粒', '微丸', '细粒', '中药材', '胶囊',
          '控释口颊片', '肠溶微粒胶囊', '咀嚼胶', '浸膏片',  '粉(药材)',
          '露(含糖型)', '大蜜丸', '缓释颗粒', '缓释丸剂', '糖丸',  '缓释干混悬剂',
          '泡腾颗粒', '舌下片',  '口服乳']
    s4 = ['冻干制剂', '粉针剂', '注射剂', '冻干粉', '粉剂', '粉针剂', '外用冻干制剂',
          '液体', '原液', '诊断试剂', '植入剂', '注射剂', '注射用乳', '注射液',
          '原料(注射用)', '试剂', '体内诊断试剂']
    # if x in s1:
    #     x = '其他'
    # if x in s2:
    #     x = '外用'
    # elif x in s3:
    if x in s3:
        x = '口服'
    elif x in s4:
        x = '注射'
    else:
        x = '其他'
    return x


def rep_lace(x):
    s1 = ["鼻饲", "管道喂养", "经耳给药", "经眼给药", "经鼻给药",
          "口腔/咽喉给药", "尿道给药", "气管/支气管内给药",
          "漱口", "吸入给药", "眼球内给药", "阴道给药", "直肠给药"]
    s2 = ["表面麻醉", "冲洗", "局部给药", "外用"]
    s3 = ["含服", "口服", "舌下给药"]
    s4 = ["泵内注射", "骶管注射", "动脉给药", "封闭", "腹膜腔内给药", '腹膜腔内注射',
          "肝动脉灌注", "关节内给药", "灌注", "肌内注射", "静脉滴注", '子宫内给药',
          "静脉注射", "局部浸润麻醉", "局部注射", "膀胱内给药", '心内注射',
          "皮内注射", "皮下注射", "鞘内给药", "术中栓塞", "胸膜腔内给药", '鼻甲注射',
          "血液透析", "羊膜腔内给药", "硬膜外给药", "植入给药", '胸膜腔内注射',
          "肿瘤内注射", "注射", "椎管给药", "子宫颈给药"]
    if x in s1:
        x = '其他'
    elif x in s2:
        x = '外用'
    elif x in s3:
        x = '口服'
    elif x in s4:
        x = '注射'
    return x


def jixing(df):
    df['剂型'] = df['potion_form'].apply(re_place)
    # df['给药途径'] = df['给药途径'].apply(rep_lace)
    return df


def find_new(df_1):  # 判断新的类型
    df_1.dropna(subset=['meddra_id'], inplace=True)
    start = time.time()
    df1 = df_1[['adr_date_year', 'generic_name', 'meddra_id', 'is_new']].copy()
    syear = df1['adr_date_year'].unique()
    good = pd.DataFrame()
    for ok in syear:
        df111 = df1[df1['adr_date_year'] <= ok].copy()
        grouped = df111.groupby(['generic_name', 'meddra_id']).prod().reset_index()
        grouped['adr_date_year'] = ok
        grouped = grouped[['adr_date_year', 'generic_name', 'meddra_id', 'is_new']]
        good = pd.concat([good, grouped], axis=0, ignore_index=True)

    end0 = pd.merge(df_1.drop(columns='is_new'), good, how='inner',
                   on=['adr_date_year', 'generic_name', 'meddra_id'])
    end = time.time()
    print('判断(报告类型-新的)耗时：', end - start, 's')
    return end0
